// omikuji.js
const drawBtn = document.getElementById("drawOmikuji");
const resultBox = document.getElementById("omikujiResult");
const backBtn = document.getElementById("backBtn");

const omikujiList = [
  "🎺 大吉：今日は何をやってもうまくいく！",
  "🥁 中吉：音程良すぎて泣きそう。",
  "🎷 小吉：ブレスコントロール余裕ですって感じ！",
  "🪇 吉：今日の音程はだいたいOK チューナー信じろ！",
  "🎵 凶：小説番号を書いてなくて怒られるかも...確認しておこう！",
  "🎹 大凶：日頃の行いかも...？広報の誰かの仕事を手伝えば運気も回復！",
  "✨ 末吉：奇跡のハーモニー発生！神に祝福されたサウンド！",
];

const luckyNotes = [
  "ハ長調「無垢に喜ばしい」",
  "ニ長調「意気揚々とした、勝利の、喊声」",
  "ホ長調「荒々しい、不十分な満足」",
  "ヘ長調「」", 
  "ト長調「」",
  "イ長調「」",
  "ロ長調「」",
  "嬰ハ長調「」",
  "嬰ヘ長調「」",
  "変ホ長調「」", 
  "変イ長調「」",
  "変ロ長調「」",
  "ハ短調「」",
  "ニ短調「」",
  "ホ短調「」",
  "ヘ短調「」", 
  "ト短調「」",
  "イ短調「」",
  "ロ短調「」",
  "嬰ハ短調「」",
  "嬰ニ短調「」",
  "嬰ヘ短調「」",
  "嬰ト短調「」",
  "嬰イ短調「」",
];

drawBtn.addEventListener("click", () => {
  const fortune = omikujiList[Math.floor(Math.random() * omikujiList.length)];
  const note = luckyNotes[Math.floor(Math.random() * luckyNotes.length)];
  resultBox.innerHTML = `
    <p>${fortune}</p>
    <p>今日のおすすめ練習調：<b style="font-size:24px;">${note}</b></p>
  `;
});

backBtn.addEventListener("click", () => {
  window.location.href = "index.html";
});
